app/controllers/admin/blog_controller.rb

  def index
    @blogs = Blog.paginate(:page => params[:page], :per_page => 15)
---
SELECT COUNT(*) FROM `blogs`
SELECT `blogs`.* FROM `blogs` LIMIT 15 OFFSET 0

  def create
    @blog = Blog.new({:user_id => session[:user],:title => params[:title], :content => params[:content1.to_s]})
    if @blog.valid? && @blog.save!
---
INSERT INTO `blogs` (`category_id`, `content`, `created_at`, `title`, `updated_at`, `user_id`) VALUES (NULL, 'dasdas', '2013-05-26 12:47:59', 'dasd', '2013-05-26 12:47:59', NULL)

  def edit
    @blog = Blog.find_by_id(params[:id])
---
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 14 LIMIT 1

  def update
    @blog = Blog.find_by_id(params[:id])
    @blog.attributes = {:title => params[:title], :content => params[:content1]}
    if @blog.valid? && @blog.save!
---
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 2 LIMIT 1
UPDATE `blogs` SET `title` = 'dasddsad', `content` = '<pre class=\"prettyprint lang-rb\">redirect_to :action =&gt; \"show\", :id =&gt; 5\r\n&nbsp;redirect_to post \r\nredirect_to \"http://www.rubyonrails.org\"\r\n&nbsp;redirect_to \"/images/screenshot.jpg\"\r\n&nbsp;redirect_to articles_url\r\n&nbsp;redirect_to :back \r\nredirect_to proc { edit_post_url(@post) }\r\n\r\n</pre>\r\n<br />', `updated_at` = '2013-05-30 11:47:18' WHERE `blogs`.`id` = 5

  def show
    @blog = Blog.find_by_id(params[:id])
---
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1

  def destroy
    blog = Blog.find_by_id(params[:id])
    if blog
      blog.destroy
---
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
DELETE FROM `blogs` WHERE `blogs`.`id` = 1