app/controllers/blog_controller.rb

SELECT COUNT(*) FROM `blogs`
SELECT `blogs`.* FROM `blogs` LIMIT 5 OFFSET 0
---
  def index
    @blogs = Blog.paginate(:page => params[:page], :per_page => 5)

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
---
  def show
    @blog = Blog.find_by_id(params[:id])