app/controllers/comment_controller.rb

INSERT INTO `comments` (`blog_id`, `content`, `created_at`, `email`, `name`, `updated_at`) VALUES (NULL, '', '2013-06-01 06:13:48', '', '', '2013-06-01 06:13:48')
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 5 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`blog_id` = 5
---
  def create
    @comment = Comment.new(params[:comment])
    if @comment.valid?
      @comment.save!
      redirect_to  blog_path(@comment.blog)
    else
      @blog = Blog.find_by_id(params[:comment][:blog_id])