app/views/blog/index.html.erb

SELECT COUNT(*) FROM `comments` WHERE `comments`.`blog_id` = 3
---
      <ul class="stats">
        <li><a href="/blog/<%=blog.id%>#respond" class="link-icon24 link-icon24-1"><%=blog.comments.size%></a></li>